In [3]:
import pandas as pd
import pyodbc   # library to connect to the data base
import numpy as np
import sqlalchemy
%load_ext sql   # SQL magic string
import urllib

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [4]:
#Connections to MS SQL Server
connection_str = "DRIVER={SQL SERVER};SERVER=DESKTOP-4E75C8B;DATABASE=Rob;TRUSTED_CONNECTION=YES"
connection_str_quoted = urllib.parse.quote_plus(connection_str)
connection_uri = 'mssql+pyodbc:///?odbc_connect={}'.format(connection_str_quoted)

# this is how you would connect in sqlalchemy
import sqlalchemy
conn = sqlalchemy.create_engine(connection_uri)

%sql {connection_uri}

In [5]:
%%sql
select * from student

 * mssql+pyodbc:///?odbc_connect=DRIVER={SQL SERVER};SERVER=DESKTOP-4E75C8B;DATABASE=Rob;TRUSTED_CONNECTION=YES
Done.

[(1, 'Robin', 'Gaj', 9811841133, 'robteotia@gmail.com'),
 (2, 'Yuvika', 'Gaj', 9211842233, 'abcd@gmail.com'),
 (3, 'Priya', 'John', 9811841133, 'zy@gamil.com')]

In [6]:
%%sql
Insert into student
Values(4,'jack','Arnold',3337778889,'jack@gmail.com')

 * mssql+pyodbc:///?odbc_connect=DRIVER={SQL SERVER};SERVER=DESKTOP-4E75C8B;DATABASE=Rob;TRUSTED_CONNECTION=YES
1 rows affected.

[]

In [7]:
%%sql
select * from student

 * mssql+pyodbc:///?odbc_connect=DRIVER={SQL SERVER};SERVER=DESKTOP-4E75C8B;DATABASE=Rob;TRUSTED_CONNECTION=YES
Done.

[(1, 'Robin', 'Gaj', 9811841133, 'robteotia@gmail.com'),
 (2, 'Yuvika', 'Gaj', 9211842233, 'abcd@gmail.com'),
 (3, 'Priya', 'John', 9811841133, 'zy@gamil.com'),
 (4, 'jack', 'Arnold', 3337778889, 'jack@gmail.com')]

In [9]:
%%sql
SELECT Name,Mobile
FROM Student WHERE Roll=1

 * mssql+pyodbc:///?odbc_connect=DRIVER={SQL SERVER};SERVER=DESKTOP-4E75C8B;DATABASE=Rob;TRUSTED_CONNECTION=YES
Done.

[('Robin', 9811841133)]